anand-010/HomepiWALL/STM32CubeIDE/Application/User/TuyaMcu/protocol.c
    //This code is automatically generated by the platform. 
    //Please modify each reportable and reportable function according to the actual data.
    mcu_dp_bool_update(DPID_SWITCH_1, 0);
    mcu_dp_bool_update(DPID_SWITCH_2,0); //BOOL型数据上报;
    mcu_dp_bool_update(DPID_SWITCH_3, 0); //BOOL型数据上报;
    mcu_dp_bool_update(DPID_SWITCH_4, 0); //BOOL型数据上报;
    mcu_dp_value_update(DPID_COUNTDOWN_1, 0); //VALUE型数据上报;
    mcu_dp_value_update(DPID_COUNTDOWN_2, 0); //VALUE型数据上报;
    mcu_dp_value_update(DPID_COUNTDOWN_3, 0); //VALUE型数据上报;
    mcu_dp_value_update(DPID_COUNTDOWN_4, 0); //VALUE型数据上报;
    mcu_dp_bool_update(DPID_SWITCH_ALL, 0); //BOOL型数据上报;
    mcu_dp_enum_update(DPID_RELAY_STATUS, 0); //枚举型数据上报;
    mcu_dp_enum_update(DPID_LIGHT_MODE, 0); //枚举型数据上报;
    mcu_dp_bool_update(DPID_BACKLIGHT_SWITCH, 0); //BOOL型数据上报;
    mcu_dp_string_update(DPID_SWITCH_INCHING, "ON", 2); //STRING型数据上报;
    mcu_dp_value_update(DPID_BACKLIGHT, 0); //VALUE型数据上报;
    mcu_dp_enum_update(DPID_COLOUR, 0); //枚举型数据上报;

}


/******************************************************************************
                                WARNING!!!    
                            2:All data upload processing
Automate code template functions, please implement data processing by yourself
******************************************************************************/
/*****************************************************************************
Function name : dp_download_switch_1_handle
Function description : on DPID_SWITCH_1 processing function
Input parameter : value:Source data
        : length:Data length
Return parameter : Successful return:SUCCESS/Failed to return:ERROR
Instructions for use : 可下发可上报type,need to report the result to App after data is dealt with
*****************************************************************************/
static unsigned char dp_download_switch_1_handle(const unsigned char value[], unsigned short length)
{
    //Example: The current DP type isBOOL
    unsigned char ret;
    //0:关/1:开
    unsigned char switch_1;
    CDC_Transmit_FS("got sm",6);
    switch_1 = mcu_get_dp_download_bool(value,length);
    controlChangeFlag = 1;
    if(switch_1 == 0) {
    	SwitchDatas[0].state = false;
    	HAL_GPIO_WritePin(GPIOG, GPIO_PIN_6, GPIO_PIN_RESET);
    }else {
    	SwitchDatas[0].state = true;
    	HAL_GPIO_WritePin(GPIOG, GPIO_PIN_6, GPIO_PIN_SET);
    }
  
    //处理完DP数据后应有反馈
    ret = mcu_dp_bool_update(DPID_SWITCH_1,switch_1);
    if(ret == T_SUCCESS)
        return T_SUCCESS;
    else
        return T_ERROR;
}

void pollingRoutine(){
	if(controlChangeFlag) {
		osSemaphoreRelease(binarySemTuyaHandle);
		controlChangeFlag = 0;
	}
}
/*****************************************************************************
Function name : dp_download_switch_2_handle
Function description : on DPID_SWITCH_2 processing function
Input parameter : value:Source data
        : length:Data length
Return parameter : Successful return:SUCCESS/Failed to return:ERROR
Instructions for use : 可下发可上报type,need to report the result to App after data is dealt with
*****************************************************************************/
static unsigned char dp_download_switch_2_handle(const unsigned char value[], unsigned short length)
{
    //Example: The current DP type isBOOL
    unsigned char ret;
    //0:关/1:开
    unsigned char switch_2;
    
    switch_2 = mcu_get_dp_download_bool(value,length);
    if(switch_2 == 0) {
        //开关关
    }else {
        //开关开
    }
  
    //处理完DP数据后应有反馈
    ret = mcu_dp_bool_update(DPID_SWITCH_2,switch_2);
    if(ret == T_SUCCESS)
        return T_SUCCESS;
    else
        return T_ERROR;
}
/*****************************************************************************
Function name : dp_download_switch_3_handle
Function description : on DPID_SWITCH_3 processing function
Input parameter : value:Source data
        : length:Data length
Return parameter : Successful return:SUCCESS/Failed to return:ERROR
Instructions for use : 可下发可上报type,need to report the result to App after data is dealt with
*****************************************************************************/
static unsigned char dp_download_switch_3_handle(const unsigned char value[], unsigned short length)
{
    //Example: The current DP type isBOOL
    unsigned char ret;
    //0:关/1:开
    unsigned char switch_3;
    
    switch_3 = mcu_get_dp_download_bool(value,length);
    if(switch_3 == 0) {
        //开关关
    }else {
        //开关开
    }
  
    //处理完DP数据后应有反馈
    ret = mcu_dp_bool_update(DPID_SWITCH_3,switch_3);
    if(ret == T_SUCCESS)
        return T_SUCCESS;
    else
        return T_ERROR;
}
/*****************************************************************************
Function name : dp_download_switch_4_handle
Function description : on DPID_SWITCH_4 processing function
Input parameter : value:Source data
        : length:Data length
Return parameter : Successful return:SUCCESS/Failed to return:ERROR
Instructions for use : 可下发可上报type,need to report the result to App after data is dealt with
*****************************************************************************/
static unsigned char dp_download_switch_4_handle(const unsigned char value[], unsigned short length)
{
    //Example: The current DP type isBOOL
    unsigned char ret;
    //0:关/1:开
    unsigned char switch_4;
    
    switch_4 = mcu_get_dp_download_bool(value,length);
    if(switch_4 == 0) {
        //开关关
    }else {
        //开关开
    }
  
    //处理完DP数据后应有反馈
    ret = mcu_dp_bool_update(DPID_SWITCH_4,switch_4);
    if(ret == T_SUCCESS)
        return T_SUCCESS;
    else
        return T_ERROR;
}
/*****************************************************************************
Function name : dp_download_countdown_1_handle
Function description : on DPID_COUNTDOWN_1 processing function
Input parameter : value:Source data
        : length:Data length
Return parameter : Successful return:SUCCESS/Failed to return:ERROR
Instructions for use : 可下发可上报type,need to report the result to App after data is dealt with
*****************************************************************************/
static unsigned char dp_download_countdown_1_handle(const unsigned char value[], unsigned short length)
{
    //Example: The current DP type isVALUE
    unsigned char ret;
    unsigned long countdown_1;
    
    countdown_1 = mcu_get_dp_download_value(value,length);
    /*
    //VALUE类型数据处理
    
    */
    
    //处理完DP数据后应有反馈
    ret = mcu_dp_value_update(DPID_COUNTDOWN_1,countdown_1);
    if(ret == T_SUCCESS)
        return T_SUCCESS;
    else
        return T_ERROR;
}
/*****************************************************************************
Function name : dp_download_countdown_2_handle
Function description : on DPID_COUNTDOWN_2 processing function
Input parameter : value:Source data
        : length:Data length
Return parameter : Successful return:SUCCESS/Failed to return:ERROR
Instructions for use : 可下发可上报type,need to report the result to App after data is dealt with
*****************************************************************************/
static unsigned char dp_download_countdown_2_handle(const unsigned char value[], unsigned short length)
{
    //Example: The current DP type isVALUE
    unsigned char ret;
    unsigned long countdown_2;
    
    countdown_2 = mcu_get_dp_download_value(value,length);
    /*
    //VALUE类型数据处理
    
    */
    
    //处理完DP数据后应有反馈
    ret = mcu_dp_value_update(DPID_COUNTDOWN_2,countdown_2);
    if(ret == T_SUCCESS)
        return T_SUCCESS;
    else
        return T_ERROR;
}
/*****************************************************************************
Function name : dp_download_countdown_3_handle
Function description : on DPID_COUNTDOWN_3 processing function
Input parameter : value:Source data
        : length:Data length
Return parameter : Successful return:SUCCESS/Failed to return:ERROR
Instructions for use : 可下发可上报type,need to report the result to App after data is dealt with
*****************************************************************************/
static unsigned char dp_download_countdown_3_handle(const unsigned char value[], unsigned short length)
{
    //Example: The current DP type isVALUE
    unsigned char ret;
    unsigned long countdown_3;
    
    countdown_3 = mcu_get_dp_download_value(value,length);
    /*
    //VALUE类型数据处理
    
    */
    
    //处理完DP数据后应有反馈
    ret = mcu_dp_value_update(DPID_COUNTDOWN_3,countdown_3);
    if(ret == T_SUCCESS)
        return T_SUCCESS;
    else
        return T_ERROR;
}
/*****************************************************************************
Function name : dp_download_countdown_4_handle
Function description : on DPID_COUNTDOWN_4 processing function
Input parameter : value:Source data
        : length:Data length
Return parameter : Successful return:SUCCESS/Failed to return:ERROR
Instructions for use : 可下发可上报type,need to report the result to App after data is dealt with
*****************************************************************************/
static unsigned char dp_download_countdown_4_handle(const unsigned char value[], unsigned short length)
{
    //Example: The current DP type isVALUE
    unsigned char ret;
    unsigned long countdown_4;
    
    countdown_4 = mcu_get_dp_download_value(value,length);
    /*
    //VALUE类型数据处理
    
    */
    
    //处理完DP数据后应有反馈
    ret = mcu_dp_value_update(DPID_COUNTDOWN_4,countdown_4);
    if(ret == T_SUCCESS)
        return T_SUCCESS;
    else
        return T_ERROR;
}
/*****************************************************************************
Function name : dp_download_switch_all_handle
Function description : on DPID_SWITCH_ALL processing function
Input parameter : value:Source data
        : length:Data length
Return parameter : Successful return:SUCCESS/Failed to return:ERROR
Instructions for use : 可下发可上报type,need to report the result to App after data is dealt with
*****************************************************************************/
static unsigned char dp_download_switch_all_handle(const unsigned char value[], unsigned short length)
{
    //Example: The current DP type isBOOL
    unsigned char ret;
    //0:关/1:开
    unsigned char switch_all;
    
    switch_all = mcu_get_dp_download_bool(value,length);
    if(switch_all == 0) {
        //开关关
    }else {
        //开关开
    }
  
    //处理完DP数据后应有反馈
    ret = mcu_dp_bool_update(DPID_SWITCH_ALL,switch_all);
    if(ret == T_SUCCESS)
        return T_SUCCESS;
    else
        return T_ERROR;
}
/*****************************************************************************
Function name : dp_download_relay_status_handle
Function description : on DPID_RELAY_STATUS processing function
Input parameter : value:Source data
        : length:Data length
Return parameter : Successful return:SUCCESS/Failed to return:ERROR
Instructions for use : 可下发可上报type,need to report the result to App after data is dealt with
*****************************************************************************/
static unsigned char dp_download_relay_status_handle(const unsigned char value[], unsigned short length)
{
    //Example: The current DP type isENUM
    unsigned char ret;
    unsigned char relay_status;
    
    relay_status = mcu_get_dp_download_enum(value,length);
    switch(relay_status) {
        case 0:
        break;
        
        case 1:
        break;
        
