anand-010/HomepiWALL/STM32CubeIDE/Application/User/TuyaMcu/protocol.c
        case 2:
        break;
        
        default:
    
        break;
    }
    
    //处理完DP数据后应有反馈
    ret = mcu_dp_enum_update(DPID_RELAY_STATUS, relay_status);
    if(ret == T_SUCCESS)
        return T_SUCCESS;
    else
        return T_ERROR;
}
/*****************************************************************************
Function name : dp_download_light_mode_handle
Function description : on DPID_LIGHT_MODE processing function
Input parameter : value:Source data
        : length:Data length
Return parameter : Successful return:SUCCESS/Failed to return:ERROR
Instructions for use : 可下发可上报type,need to report the result to App after data is dealt with
*****************************************************************************/
static unsigned char dp_download_light_mode_handle(const unsigned char value[], unsigned short length)
{
    //Example: The current DP type isENUM
    unsigned char ret;
    unsigned char light_mode;
    
    light_mode = mcu_get_dp_download_enum(value,length);
    switch(light_mode) {
        case 0:
        break;
        
        case 1:
        break;
        
        case 2:
        break;
        
        default:
    
        break;
    }
    
    //处理完DP数据后应有反馈
    ret = mcu_dp_enum_update(DPID_LIGHT_MODE, light_mode);
    if(ret == T_SUCCESS)
        return T_SUCCESS;
    else
        return T_ERROR;
}
/*****************************************************************************
Function name : dp_download_backlight_switch_handle
Function description : on DPID_BACKLIGHT_SWITCH processing function
Input parameter : value:Source data
        : length:Data length
Return parameter : Successful return:SUCCESS/Failed to return:ERROR
Instructions for use : 可下发可上报type,need to report the result to App after data is dealt with
*****************************************************************************/
static unsigned char dp_download_backlight_switch_handle(const unsigned char value[], unsigned short length)
{
    //Example: The current DP type isBOOL
    unsigned char ret;
    //0:关/1:开
    unsigned char backlight_switch;
    
    backlight_switch = mcu_get_dp_download_bool(value,length);
    if(backlight_switch == 0) {
        //开关关
    }else {
        //开关开
    }
  
    //处理完DP数据后应有反馈
    ret = mcu_dp_bool_update(DPID_BACKLIGHT_SWITCH,backlight_switch);
    if(ret == T_SUCCESS)
        return T_SUCCESS;
    else
        return T_ERROR;
}
/*****************************************************************************
Function name : dp_download_switch_inching_handle
Function description : on DPID_SWITCH_INCHING processing function
Input parameter : value:Source data
        : length:Data length
Return parameter : Successful return:SUCCESS/Failed to return:ERROR
Instructions for use : 可下发可上报type,need to report the result to App after data is dealt with
*****************************************************************************/
static unsigned char dp_download_switch_inching_handle(const unsigned char value[], unsigned short length)
{
    //Example: The current DP type isSTRING
    unsigned char ret;
    /*
    //STRING类型数据处理
    unsigned char string_data[8];
    
    string_data[0] = value[0];
    string_data[1] = value[1];
    string_data[2] = value[2];
    string_data[3] = value[3];
    string_data[4] = value[4];
    string_data[5] = value[5];
    string_data[6] = value[6];
    string_data[7] = value[7];
    */
    
    //处理完DP数据后应有反馈
    ret = mcu_dp_string_update(DPID_SWITCH_INCHING,value, length);
    if(ret == T_SUCCESS)
        return T_SUCCESS;
    else
        return T_ERROR;
}
/*****************************************************************************
Function name : dp_download_backlight_handle
Function description : on DPID_BACKLIGHT processing function
Input parameter : value:Source data
        : length:Data length
Return parameter : Successful return:SUCCESS/Failed to return:ERROR
Instructions for use : 可下发可上报type,need to report the result to App after data is dealt with
*****************************************************************************/
static unsigned char dp_download_backlight_handle(const unsigned char value[], unsigned short length)
{
    //Example: The current DP type isVALUE
    unsigned char ret;
    unsigned long backlight;
    
    backlight = mcu_get_dp_download_value(value,length);
    /*
    //VALUE类型数据处理
    
    */
    
    //处理完DP数据后应有反馈
    ret = mcu_dp_value_update(DPID_BACKLIGHT,backlight);
    if(ret == T_SUCCESS)
        return T_SUCCESS;
    else
        return T_ERROR;
}
/*****************************************************************************
Function name : dp_download_colour_handle
Function description : on DPID_COLOUR processing function
Input parameter : value:Source data
        : length:Data length
Return parameter : Successful return:SUCCESS/Failed to return:ERROR
Instructions for use : 可下发可上报type,need to report the result to App after data is dealt with
*****************************************************************************/
static unsigned char dp_download_colour_handle(const unsigned char value[], unsigned short length)
{
    //Example: The current DP type isENUM
    unsigned char ret;
    unsigned char colour;
    
    colour = mcu_get_dp_download_enum(value,length);
    switch(colour) {
        case 0:
        break;
        
        case 1:
        break;
        
        case 2:
        break;
        
        case 3:
        break;
        
        case 4:
        break;
        
        case 5:
        break;
        
        case 6:
        break;
        
        case 7:
        break;
        
        case 8:
        break;
        
        default:
    
        break;
    }
    
    //处理完DP数据后应有反馈
    ret = mcu_dp_enum_update(DPID_COLOUR, colour);
    if(ret == T_SUCCESS)
        return T_SUCCESS;
    else
        return T_ERROR;
}




/******************************************************************************
                                WARNING!!!                     
The following function users do not modify!!
******************************************************************************/

/**
 * @brief  dp delivery processing function
 * @param[in] {dpid} DP number
 * @param[in] {value} dp data buffer address
 * @param[in] {length} dp data length
 * @return Dp processing results
 * -           0(ERROR): failure
 * -           1(SUCCESS): success
 * @note   The function user cannot modify
 */
unsigned char dp_download_handle(unsigned char dpid,const unsigned char value[], unsigned short length)
{
    /*********************************
    Current function processing can issue/report data calls                    
    Need to implement the data processing in the specific function
    The result of the processing needs to be fed back to the APP, otherwise the APP will consider the delivery failure.
    ***********************************/
    unsigned char ret;
    switch(dpid) {
        case DPID_SWITCH_1:
            //开关1processing function
            ret = dp_download_switch_1_handle(value,length);
        break;
        case DPID_SWITCH_2:
            //开关2processing function
            ret = dp_download_switch_2_handle(value,length);
        break;
        case DPID_SWITCH_3:
            //开关3processing function
            ret = dp_download_switch_3_handle(value,length);
        break;
        case DPID_SWITCH_4:
            //开关4processing function
            ret = dp_download_switch_4_handle(value,length);
        break;
        case DPID_COUNTDOWN_1:
            //开关1倒计时processing function
            ret = dp_download_countdown_1_handle(value,length);
        break;
        case DPID_COUNTDOWN_2:
            //开关2倒计时processing function
            ret = dp_download_countdown_2_handle(value,length);
        break;
        case DPID_COUNTDOWN_3:
            //开关3倒计时processing function
            ret = dp_download_countdown_3_handle(value,length);
        break;
        case DPID_COUNTDOWN_4:
            //开关4倒计时processing function
            ret = dp_download_countdown_4_handle(value,length);
        break;
        case DPID_SWITCH_ALL:
            //总开关processing function
            ret = dp_download_switch_all_handle(value,length);
        break;
        case DPID_RELAY_STATUS:
            //上电状态设置processing function
            ret = dp_download_relay_status_handle(value,length);
        break;
        case DPID_LIGHT_MODE:
            //指示灯状态设置processing function
            ret = dp_download_light_mode_handle(value,length);
        break;
        case DPID_BACKLIGHT_SWITCH:
            //背光开关processing function
            ret = dp_download_backlight_switch_handle(value,length);
        break;
        case DPID_SWITCH_INCHING:
            //点动开关（延时关）processing function
            ret = dp_download_switch_inching_handle(value,length);
        break;
        case DPID_BACKLIGHT:
            //Backlight intensityprocessing function
            ret = dp_download_backlight_handle(value,length);
        break;
        case DPID_COLOUR:
            //Colourprocessing function
            ret = dp_download_colour_handle(value,length);
        break;

        
        default:
        break;
    }
    return ret;
}

/**
 * @brief  Get the sum of all dp commands
 * @param[in] Null
 * @return Sent the sum of the commands
 * @note   The function user cannot modify
 */
unsigned char get_download_cmd_total(void)
{
    return(sizeof(download_cmd) / sizeof(download_cmd[0]));
}


