anand-010/HomepiWALL/STM32CubeIDE/Application/User/TuyaMcu/protocol.c
/******************************************************************************
                                WARNING!!!                     
This code is called internally by the SDK.
Please implement the internal data of the function according to the actual dp data.
******************************************************************************/

#ifdef SUPPORT_MCU_FIRM_UPDATE
/**
 * @brief  Upgrade package size selection
 * @param[in] {package_sz} Upgrade package size
 * @ref           0x00: 256byte (default)
 * @ref           0x01: 512byte
 * @ref           0x02: 1024byte
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void upgrade_package_choose(unsigned char package_sz)
{
    #error "Please implement the upgrade package size selection processing code by yourself. Please delete this line after completion"
    unsigned short send_len = 0;
    send_len = set_wifi_uart_byte(send_len, package_sz);
    wifi_uart_write_frame(UPDATE_START_CMD, MCU_TX_VER, send_len);
}

/**
 * @brief  MCU enters firmware upgrade mode
 * @param[in] {value} Firmware buffer
 * @param[in] {position} The current data packet is in the firmware location
 * @param[in] {length} Current firmware package length (when the firmware package length is 0, it indicates that the firmware package is sent)
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
unsigned char mcu_firm_update_handle(const unsigned char value[],unsigned long position,unsigned short length)
{
    #error "Please complete the MCU firmware upgrade processing code yourself. Please delete the line after completion"
    if(length == 0) {
        //Firmware data transmission completed
      
    }else {
        //Firmware data processing
      
    }
    
    return SUCCESS;
}
#endif

#ifdef SUPPORT_GREEN_TIME
/**
 * @brief  Gets the green time
 * @param[in] {time} Get the time data
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void mcu_get_greentime(unsigned char time[])
{
    #error "Complete the code yourself and delete the line"
    /*
    time[0] is the flag of success for obtaining the time,0: failure / 1: success
    time[1] is year, 0x00 :2000 year
    time[2] is month, It starts at 1 and ends at 12
    time[3] is date, It starts at 1 and ends at 31
    time[4] is hour, It starts at 0 and ends at 23
    time[5] is minute, It starts at 0 and ends at 59
    time[6] is second, It starts at 0 and ends at 59
    */
    if(time[0] == 1) {
        //Receive the green data returned by wifi module correctly
        
    }else {
        //There is an error in obtaining the green time. It may be that the current wifi module is not connected to the Internet
    }
}
#endif

#ifdef SUPPORT_MCU_RTC_CHECK
/**
 * @brief  MCU proofreads local RTC clock
 * @param[in] {time} Get the time data
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void mcu_write_rtctime(unsigned char time[])
{
    #error "Please complete the RTC clock write code yourself and delete the line"
    /*
    Time[0] is the time success flag, 0 is a failure, and 1 is a success.
    Time[1] is the year and 0x00 is the year 2000.
    Time[2] is the month, starting from 1 to ending at 12
    Time[3] is the date, starting from 1 to 31
    Time[4] is the clock, starting from 0 to ending at 23
    Time[5] is minutes, starting from 0 to ending at 59
    Time[6] is seconds, starting from 0 to ending at 59
    Time[7] is the week, starting from 1 to 7 and 1 is Monday.
   */
    if(time[0] == 1) {
        //Correctly receive the local clock data returned by the wifi module
     
    }else {
        //Error getting local clock data, it may be that the current wifi module is not connected
    }
}
#endif

#ifdef WIFI_TEST_ENABLE
/**
 * @brief  Wifi function test feedback
 * @param[in] {result} Wifi function test
 * @ref       0: failure
 * @ref       1: success
 * @param[in] {rssi} Test success indicates wifi signal strength / test failure indicates error type
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void wifi_test_result(unsigned char result,unsigned char rssi)
{
    // #error "Please implement the wifi function test success/failure code by yourself. Please delete the line after completion"
    if(result == 0) {
        //Test failed
        if(rssi == 0x00) {
            //Can't scan to the router named tuya_mdev_test, please check
        }else if(rssi == 0x01) {
            //Module not authorized
        }
    }else {
        //Test success
        //rssi is the signal strength (0-100, 0 signal is the worst, 100 signal is the strongest)
    }
}
#endif

#ifdef WEATHER_ENABLE
/**
* @brief  Open weather service
 * @param  Null
 * @return Null
 */
void mcu_open_weather(void)
{
    int i = 0;
    char buffer[13] = {0};
    unsigned char weather_len = 0;
    unsigned short send_len = 0;
    
    weather_len = sizeof(weather_choose) / sizeof(weather_choose[0]);
      
    for(i=0;i<weather_len;i++) {
        buffer[0] = sprintf(buffer+1,"w.%s",weather_choose[i]);
        send_len = set_wifi_uart_buffer(send_len, (unsigned char *)buffer, buffer[0]+1);
    }
    
    //#error "Please read the following instructions,After the processing is completed, delete the line"
    /*
    //When the parameters obtained have parameters related to time (such as sunrise and sunset), 
    //they need to be used with t.unix or t.local, and whether the parameter data needed to be acquired is based on green time or local time.
    
    buffer[0] = sprintf(buffer+1,"t.unix"); //green time   or use  // buffer[0] = sprintf(buffer+1,"t.local"); //local time
    length = set_wifi_uart_buffer(length, (unsigned char *)buffer, buffer[0]+1);
    */
    
    buffer[0] = sprintf(buffer+1,"w.date.%d",WEATHER_FORECAST_DAYS_NUM);
    send_len = set_wifi_uart_buffer(send_len, (unsigned char *)buffer, buffer[0]+1);
    
    wifi_uart_write_frame(WEATHER_OPEN_CMD, MCU_TX_VER, send_len);
}

/**
 * @brief  Turn on the weather function
 * @param[in] {res} Turn on the weather function to return the result
 * @ref       0: failure
 * @ref       1: success
 * @param[in] {err} Error code
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void weather_open_return_handle(unsigned char res, unsigned char err)
{
   // #error "Please complete the M open weather function to return the data processing code. Please delete the line after completion"
    unsigned char err_num = 0;
    
    if(res == 1) {
        //Open the weather and return successfully
    }else if(res == 0) {
        //Open weather return failed
        //Get the error code
        err_num = err; 
    }
}

/**
 * @brief  Weather data user self-processing function
 * @param[in] {name} parameter name
 * @param[in] {type} parameter type
 * @ref       0: int
 * @ref       1: string
 * @param[in] {data} the address of the parameter value
 * @param[in] {day} What day's weather. range of value: 0~6
 * @ref       0: today
 * @ref       1: tomorrow
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void weather_data_user_handle(char *name, unsigned char type, const unsigned char *data, char day)
{
    //#error "Here is just an example. Please correct the weather data processing code yourself. Please delete the line after you finish."
    int value_int;
    char value_string[50];//Since there are many parameters, the default is 50. You can reduce this value appropriately based on the defined parameters.
    
    my_memset(value_string, '\0', 50);
    
  //First get the data type
    if(type == 0) { //The parameter is INT type
        value_int = data[0] << 24 | data[1] << 16 | data[2] << 8 | data[3];
    }else if(type == 1) {
        my_strcpy(value_string, data);
    }
    
    //Note that the parameter value is obtained according to the selected parameter type!!!
    if(my_strcmp(name, "temp") == 0) {
        printf("day:%d temp value is:%d\r\n", day, value_int);          //int type
    }else if(my_strcmp(name, "humidity") == 0) {
        printf("day:%d humidity value is:%d\r\n", day, value_int);      //int type
    }else if(my_strcmp(name, "pm25") == 0) {
        printf("day:%d pm25 value is:%d\r\n", day, value_int);          //int type
    }else if(my_strcmp(name, "condition") == 0) {
        printf("day:%d condition value is:%s\r\n", day, value_string);  //string type
    }
}
#endif

#ifdef MCU_DP_UPLOAD_SYN
/**
 * @brief  Status reports results synchronously
 * @param[in] {result} Result
 * @ref       0: failure
 * @ref       1: success
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void get_upload_syn_result(unsigned char result)
{
    #error "Please complete the status report result processing code by yourself and delete the line"
      
