anand-010/HomepiWALL/STM32CubeIDE/Application/User/TuyaMcu/protocol.c
    if(result == 0) {
        //Synchronous report error
    }else {
        //Report synchronously successfully
    }
}
#endif

#ifdef GET_WIFI_STATUS_ENABLE
/**
 * @brief  Get the WIFI status result
 * @param[in] {result} Wifi working state
 * @ref       0x00: wifi status 1  smartconfig configuration status
 * @ref       0x01: wifi status 2  AP configuration status
 * @ref       0x02: wifi status 3  WIFI configured but not connected to the router
 * @ref       0x03: wifi status 4  WIFI Configured and connected to the router
 * @ref       0x04: wifi status 5  The router is connected and connected to the cloud
 * @ref       0x05: wifi status 6  The wifi device is in low power mode
 * @ref       0x06: wifi status 7  The wifi device is in smartconfig&AP mode
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void get_wifi_status(unsigned char result)
{
    //#error "Complete the get the WIFI status result processing code yourself and delete the line"
 
    switch(result) {
        case 0:
            //wifi working state 1
        break;
    
        case 1:
            //wifi working state 2
        break;
        
        case 2:
            //wifi working state 3
        break;
        
        case 3:
            //wifi working state 4
        break;
        
        case 4:
            //wifi working state 5
        break;
        
        case 5:
            //wifi working state 6
        break;
      
        case 6:
            //wifi working state 7
        break;
        
        default:break;
    }
}
#endif

#ifdef WIFI_STREAM_ENABLE
/**
 * @brief  Streaming service sending results
 * @param[in] {result} result
 * @ref       0x00: success
 * @ref       0x01: Streaming service feature is not enabled
 * @ref       0x02: The streaming server is not connected successfully
 * @ref       0x03: Data push timeout
 * @ref       0x04: Wrong data length
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void stream_trans_send_result(unsigned char result)
{
    #error "Complete the get the streaming service sending results code yourself and delete the line"
    switch(result) {
        case 0x00:
            //success
        break;
        
        case 0x01:
            //Streaming service feature is not enabled
        break;
        
        case 0x02:
            //The streaming server is not connected successfully
        break;
        
        case 0x03:
            //Data push timeout
        break;
        
        case 0x04:
            //Wrong data length
        break;
        
        default:break;
    }
}

/**
 * @brief  Multi-map streaming service sending results
 * @param[in] {result} result
 * @ref       0x00: success
 * @ref       0x01: fault
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void maps_stream_trans_send_result(unsigned char result)
{
    #error "Complete the get the Multi-map streaming service sending results code yourself and delete the line"
    switch(result) {
        case 0x00:
            //success
        break;
        
        case 0x01:
            //fault
        break;
        
        default:break;
    }
}
#endif

#ifdef WIFI_CONNECT_TEST_ENABLE
/**
 * @brief  Routing information receives notification of results
 * @param[in] {result} Whether the module has successfully received the correct routing information
 * @ref       0x00: failure
 * @ref       0x01: success
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void wifi_connect_test_result(unsigned char result)
{
    #error "Please implement the successful/failed wifi function test processing code by yourself, and delete the line after completion"
    if(result == 0) {
        //The routing message failed to receive. Please check whether the routing packet sent is a complete JSON packet
    }else {
        //The routing information was received successfully. Please pay attention to the wifi working state of WIFI_STATE_CMD command
    }
}
#endif

#ifdef GET_MODULE_MAC_ENABLE
/**
 * @brief  Gets the module MAC result
 * @param[in] {mac} Module MAC data
 * @ref       mac[0]: is whether to get the MAC success flag,  0x00 success, 0x01 failure
 * @ref       mac[1]~mac[6]: When obtaining the MAC address flag bit MAC [0] is successful, it represents the valid MAC address of the module
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void mcu_get_mac(unsigned char mac[])
{
    //#error "Complete the MAC fetch processing code yourself and delete the line"
    /*
    mac[0] is whether to get the MAC success flag,  0x00 success, 0x01 failure
    mac[1]~mac[6]:When obtaining the MAC address flag bit MAC [0] is successful, it represents the valid MAC address of the module
   */
   
    if(mac[0] == 1) {
        //Error getting MAC
    }else {
        //Receive the MAC address returned by wifi module correctly
    }
}
#endif

#ifdef GET_IR_STATUS_ENABLE
/**
 * @brief  Obtain the infrared state results
 * @param[in] {result} Indicating infrared state
 * @ref       0x00: Infrared state 1 Sending infrared code
 * @ref       0x01: Infrared state 2 Send infrared code to end
 * @ref       0x02: Infrared state 3 Infrared learning begins
 * @ref       0x03: Infrared state 4 End of infrared learning
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void get_ir_status(unsigned char result)
{
    #error "Please complete the infrared status processing code by yourself and delete the line"
    switch(result) {
        case 0:
            //Infrared state 1
        break;
      
        case 1:
            //Infrared state 2
        break;
          
        case 2:
            //Infrared state 3
        break;
          
        case 3:
            //Infrared state 4
        break;
          
        default:break;
    }
    
    wifi_uart_write_frame(GET_IR_STATUS_CMD, MCU_TX_VER, 0);
}
#endif

#ifdef IR_TX_RX_TEST_ENABLE
/**
 * @brief  Notification of infrared incoming and outgoing test results
 * @param[in] {result} Whether the module successfully received the correct information
 * @ref       0x00: failure
 * @ref       0x01: success
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void ir_tx_rx_test_result(unsigned char result)
{
    #error "Please implement the infrared entry, send, receive, and test functions by yourself. Please delete this line after completion"
    if(result == 0) {
        //Infrared into the transceiver production test successful
    }else {
        //Infrared incoming transceiver production test failed, please check the sent packet
    }
}
#endif

