anand-010/HomepiWALL/STM32CubeIDE/Application/User/TuyaMcu/protocol.c
#ifdef FILE_DOWNLOAD_ENABLE
/**
 * @brief  File download package size selection
 * @param[in] {package_sz} File download package size
 * @ref       0x00: 256 byte
 * @ref       0x01: 512 byte
 * @ref       0x02: 1024 byte
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void file_download_package_choose(unsigned char package_sz)
{
    #error "Please complete the file download package size selection processing code by yourself and delete the line"
    unsigned short send_len = 0;
    send_len = set_wifi_uart_byte(send_len, package_sz);
    wifi_uart_write_frame(FILE_DOWNLOAD_START_CMD, MCU_TX_VER, send_len);
}

/**
 * @brief  Package download
 * @param[in] {value} Data buffer
 * @param[in] {position} The current packet is at the file location
 * @param[in] {length} Current file package length (when the length is 0, the file package is sent)
 * @return Data processing results
 * -           0(ERROR): failure
 * -           1(SUCCESS): success
 * @note   MCU needs to implement this function by itself
 */
unsigned char file_download_handle(const unsigned char value[],unsigned long position,unsigned short length)
{
  #error "Please complete the file download selection processing code by yourself and delete the line"
    if(length == 0) {
        //File package data sending completed
        
    }else {
        //File package data processing
      
    }
    
    return SUCCESS;
}
#endif

#ifdef MODULE_EXPANDING_SERVICE_ENABLE
/**
 * @brief  Module time service notification results
 * @param[in] {value} Data buffer
 * @param[in] {length} Data buffer length
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void open_module_time_serve_result(const unsigned char value[], unsigned short length)
{
    #error "Please complete the Module time service notification results processing code by yourself and delete the line"
    unsigned char sub_cmd = value[0];
    
    switch(sub_cmd) {
        case 0x01: { //Subcommand  Turn on module time service notification
            if(0x02 != length) {
                //Data length error
                return;
            }
            
            if(value[1] == 0) {
                //Service started successfully
            }else {
                //Service startup failure
            }
        }
        break;
        
        case 0x02: {  //Subcommand  Module time service notification
            if(0x09 != length) {
                //Data length error
                return;
            }
            
            unsigned char time_type = value[1]; //0x00:Green time    0x01:Local time
            unsigned char time_data[7];
            
            my_memcpy(time_data, value + 2, length - 2);
            /*
            Data[0] is the year and 0x00 is the year 2000.
            Data[1] is the month, starting from 1 to ending at 12
            Data[2] is the date, starting from 1 to 31
            Data[3] is the clock, starting from 0 to ending at 23
            Data[4] is minutes, starting from 0 to ending at 59
            Data[5] is seconds, starting from 0 to ending at 59
            Data[6] is the week, starting from 1 to 7 and 1 is Monday.
            */
            
            //Add the time data handling code here, with time_type as the time type
            
            unsigned short send_len = 0;
            send_len = set_wifi_uart_byte(send_len,sub_cmd);
            wifi_uart_write_frame(MODULE_EXTEND_FUN_CMD, MCU_TX_VER, send_len);
        }
        break;
        
        case 0x03: {  //Subcommand  Actively request weather service data
            if(0x02 != length) {
                //Data length error
                return;
            }
            
            if(value[1] == 0) {
                //success
            }else {
                //fault
            }
        }
        break;
        
        case 0x04: {  //Subcommand  Open module reset status notification
            if(0x02 != length) {
                //Data length error
                return;
            }
            
            if(value[1] == 0) {
                //success
            }else {
                //fault
            }
        }
        break;
        
        case 0x05: {  //Subcommand  Module reset status notification
            if(0x02 != length) {
                //Data length error
                return;
            }
            
            switch(value[1]) {
                case 0x00:
                    //Module local reset
                    
                break;
                case 0x01:
                    //APP remote reset
                    
                break;
                case 0x02:
                    //APP factory reset
                    
                break;
                default:break;
            }
            
            unsigned short send_len = 0;
            send_len = set_wifi_uart_byte(send_len, sub_cmd);
            wifi_uart_write_frame(MODULE_EXTEND_FUN_CMD, MCU_TX_VER, send_len);
        }
        break;
        
        default:break;
    }
}
#endif

#ifdef BLE_RELATED_FUNCTION_ENABLE
/**
 * @brief  Bluetooth functional test results
 * @param[in] {value} Data buffer
 * @param[in] {length} Data buffer length
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void BLE_test_result(const unsigned char value[], unsigned short length)
{
    #error "Please complete the Bluetooth functional test results processing code by yourself and delete the line"
    unsigned char sub_cmd = value[0];
    
    if(0x03 != length) {
        //Data length error
        return;
    }
    
    if(0x01 != sub_cmd) {
        //Subcommand error
        return;
    }
    
    unsigned char result = value[1];
    unsigned char rssi = value[2];
        
    if(result == 0) {
        //test failure
        if(rssi == 0x00) {
            //Bluetooth beacon named ty_mdev is not scanned, please check
        }else if(rssi == 0x01) {
            //Module is not authorized
        }
    }else if(result == 0x01) {
        //Module is not authorized
        //rssiis the signal strength (0-100, 0 signal is the worst, 100 signal is the strongest)
    }
}
#endif

#ifdef VOICE_MODULE_PROTOCOL_ENABLE
/**
 * @brief  Get voice status code result
 * @param[in] {result} Voice status code
 * @ref       0x00: idle
 * @ref       0x01: mic mute state
 * @ref       0x02: wake
 * @ref       0x03: recording
 * @ref       0x04: Recognizing
 * @ref       0x05: Identified successfully
 * @ref       0x06: Recognition failed
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void get_voice_state_result(unsigned char result)
{
    #error "Please complete the get voice status code result processing code by yourself and delete the line"
    switch(result) {
        case 0:
            //idle
        break;
    
        case 1:
            //mic mute state
        break;
        
