anand-010/HomepiWALL/STM32CubeIDE/Application/User/TuyaMcu/protocol.c
        case 2:
            //wake
        break;
        
        case 3:
            //recording
        break;
        
        case 4:
            //Recognizing
        break;
    
        case 5:
            //Identified successfully
        break;
        
        case 6:
            //Recognition failed
        break;
        
      default:break;
    }
}

/**
 * @brief  MIC mute setting
 * @param[in] {result} Mute setting value
 * @ref       0x00: mic on
 * @ref       0x01: mic mute
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void set_voice_MIC_silence_result(unsigned char result)
{
    #error "Please complete the MIC mute setting processing code by yourself and delete the line"
    if(result == 0) {
        //mic on
    }else {
        //mic mute
    }
}

/**
 * @brief  speaker volume setting result
 * @param[in] {result} Volume value
 * @ref       0~10: Volume range
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void set_speaker_voice_result(unsigned char result)
{
    #error "Please complete the speaker volume setting result processing code by yourself and delete the line"
    
}

/**
 * @brief  Audio production test results
 * @param[in] {result} Audio production test status
 * @ref       0x00: Turn off audio production test
 * @ref       0x01: mic1 audio loop test
 * @ref       0x02: mic2 audio loop test
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void voice_test_result(unsigned char result)
{
    #error "Please complete the audio production test results processing code by yourself and delete the line"
    if(result == 0x00) {
        //Turn off audio production test
    }else if(result == 0x01) {
        //mic1 audio loop test
    }else if(result == 0x02) {
        //mic2 audio loop test
    }
}

/**
 * @brief  Get wake up test result
 * @param[in] {result} Wake-up return value
 * @ref       0x00: Wake up successfully
 * @ref       0x01: Wake up failure (10s timeout failure)
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void voice_awaken_test_result(unsigned char result)
{
    #error "Please complete the wake up the test results processing code by yourself and delete the line"
    if(result == 0x00) {
        //Wake up successfully
    }else if(result == 0x01) {
        //Wake up failure
    }
}

/**
 * @brief  Voice module extension function
 * @param[in] {value} Data buffer
 * @param[in] {length} Data length
 * @return Null
 * @note   MCU needs to implement this function by itself
 */
void voice_module_extend_fun(const unsigned char value[], unsigned short length)
{
    unsigned char sub_cmd = value[0];
    unsigned char play;
    unsigned char bt_play;
    unsigned short send_len = 0;
  
    switch(sub_cmd) {
        case 0x00: { //Subcommand  MCU function settings
            if(0x02 != length) {
                //Data length error
                return;
            }
            
            if(value[1] == 0) {
                //success
            }else {
                //fault
            }
        }
        break;
        
        case 0x01: {  //Subcommand  Status notification
            if(0x02 > length) {
                //Data length error
                return;
            }
            
            unsigned char play = 0xff;
            unsigned char bt_play = 0xff;
            
            const char *str_buff = (const char *)&value[1];
            const char *str_result = NULL;
            
            str_result = strstr(str_buff,"play") + my_strlen("play") + 2;
            if(NULL == str_result) {
                //data error
                goto ERR_EXTI;
            }
            
            if(0 == memcmp(str_result, "true", my_strlen("true"))) {
                play = 1;
            }else if(0 == memcmp(str_result, "false", my_strlen("false"))) {
                play = 0;
            }else {
                //data error
                goto ERR_EXTI;
            }
            
            str_result = strstr(str_buff,"bt_play") + my_strlen("bt_play") + 2;
            if(NULL == str_result) {
                //data error
                goto ERR_EXTI;
            }
            
            if(0 == memcmp(str_result, "true", my_strlen("true"))) {
                bt_play = 1;
            }else if(0 == memcmp(str_result, "false", my_strlen("false"))) {
                bt_play = 0;
            }else {
                //data error
                goto ERR_EXTI;
            }
            
            #error "Please complete the Voice module extension function code by yourself and delete the line"
            //MCU setting only supports "play/pause" "Bluetooth switch"
            //play     play/pause function 1 (play) / 0 (pause)
            //bt_play  Bluetooth switch function 1 (on) / 0 (off)
            
            
            
            send_len = 0;
            send_len = set_wifi_uart_byte(send_len, sub_cmd);
            send_len = set_wifi_uart_byte(send_len, 0x00);
            wifi_uart_write_frame(MODULE_EXTEND_FUN_CMD, MCU_TX_VER, send_len);
        }
        break;

        default:break;
    }
    
    return;

ERR_EXTI:
    send_len = 0;
    send_len = set_wifi_uart_byte(send_len, sub_cmd);
    send_len = set_wifi_uart_byte(send_len, 0x01);
    wifi_uart_write_frame(MODULE_EXTEND_FUN_CMD, MCU_TX_VER, send_len);
    return;
}
#endif




